//--------------------------------------------------------------------------------------
// vs2d.fx
//--------------------------------------------------------------------------------------
#include	"psvscommon.fx"
//--------------------------------------------------------------------------------------
// 頂点シェーダー
//--------------------------------------------------------------------------------------
VS2D_OUTPUT main(VS_INPUT_ANIMETION _input)
{
    VS2D_OUTPUT output = (VS2D_OUTPUT) 0;
    
    output.Pos = mul(_input.Pos, World);
    output.Pos.w = 1.f;
    
    output.Color = output.Pos;

    output.Tex = _input.Tex;
    
    return output;
}